; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v8 - type_2 ?v5 - type_1)
 	      (pred_3 ?v7 - object ?v5 - type_1)
	      (pred_4 ?v8 - type_2 ?v3 - type_3)
	      (pred_1 ?v8 - type_2 ?v7 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v2 ?v6 - type_1)
       :precondition (and  (pred_2 ?v8 ?v2))
       :effect (and  (pred_2 ?v8 ?v6)
		     (not (pred_2 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_2 ?v4 - object ?v1 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v1) (pred_2 ?v8 ?v1) (pred_4 ?v8 ?v3))
       :effect (and (pred_1 ?v8 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_4 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_2 ?v4 - object ?v1 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v4 ?v3) (pred_2 ?v8 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_4 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v4 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_08 obj_10 - type_3
obj_05 obj_02 obj_04 obj_03 - type_1
obj_06 obj_01 obj_07 - object)
(:init
(pred_2 obj_09 obj_02)
(pred_4 obj_09 obj_08)
(pred_4 obj_09 obj_10)
(pred_3 obj_06 obj_03)
(pred_3 obj_01 obj_04)
(pred_3 obj_07 obj_05)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_01 obj_05)
(pred_3 obj_07 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_09 ?b obj_10))))
)
)

; plan
1. (op_2 obj_09 obj_02 obj_05)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_05)
   goals met: 0 of 3
2. (op_1 obj_09 obj_07 obj_05 obj_08)
   deleted: (pred_3 obj_07 obj_05) (pred_4 obj_09 obj_08)
   added: (pred_1 obj_09 obj_07 obj_08)
   goals met: 0 of 3
3. (op_2 obj_09 obj_05 obj_03)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_03)
   goals met: 0 of 3
4. (op_3 obj_09 obj_07 obj_03 obj_08)
   deleted: (pred_1 obj_09 obj_07 obj_08)
   added: (pred_3 obj_07 obj_03) (pred_4 obj_09 obj_08)
   goals met: 1 of 3
5. (op_1 obj_09 obj_06 obj_03 obj_08)
   deleted: (pred_3 obj_06 obj_03) (pred_4 obj_09 obj_08)
   added: (pred_1 obj_09 obj_06 obj_08)
   goals met: 1 of 3
6. (op_2 obj_09 obj_03 obj_02)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_02)
   goals met: 1 of 3
7. (op_3 obj_09 obj_06 obj_02 obj_08)
   deleted: (pred_1 obj_09 obj_06 obj_08)
   added: (pred_3 obj_06 obj_02) (pred_4 obj_09 obj_08)
   goals met: 2 of 3
8. (op_2 obj_09 obj_02 obj_04)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_04)
   goals met: 2 of 3
9. (op_1 obj_09 obj_01 obj_04 obj_08)
   deleted: (pred_3 obj_01 obj_04) (pred_4 obj_09 obj_08)
   added: (pred_1 obj_09 obj_01 obj_08)
   goals met: 2 of 3
10. (op_2 obj_09 obj_04 obj_05)
   deleted: (pred_2 obj_09 obj_04)
   added: (pred_2 obj_09 obj_05)
   goals met: 2 of 3
11. (op_3 obj_09 obj_01 obj_05 obj_08)
   deleted: (pred_1 obj_09 obj_01 obj_08)
   added: (pred_3 obj_01 obj_05) (pred_4 obj_09 obj_08)
   goals met: 3 of 3
